analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_one_regs.h
/**
 * @file    afe_adc_one_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the AFE_ADC_ONE Peripheral Module.
 * @note    This file is @generated.
 * @ingroup afe_adc_one_registers
 */

/******************************************************************************
 *
 * Copyright (C) 2024 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32680_INCLUDE_AFE_ADC_ONE_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32680_INCLUDE_AFE_ADC_ONE_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     afe_adc_one
 * @defgroup    afe_adc_one_registers AFE_ADC_ONE_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the AFE_ADC_ONE Peripheral Module.
 * @details     Analog Front End ADC1 on Stacked Die via SPI
 */

/* Register offsets for module AFE_ADC_ONE */
/**
 * @ingroup    afe_adc_one_registers
 * @defgroup   AFE_ADC_ONE_Register_Offsets Register Offsets
 * @brief      AFE_ADC_ONE Peripheral Register Offsets from the AFE_ADC_ONE Base Peripheral Address.
 * @{
 */
#define MXC_R_AFE_ADC_ONE_PD               ((uint32_t)0x00800001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x800001</tt> */
#define MXC_R_AFE_ADC_ONE_CONV_START       ((uint32_t)0x00810001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x810001</tt> */
#define MXC_R_AFE_ADC_ONE_SEQ_START        ((uint32_t)0x00820001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x820001</tt> */
#define MXC_R_AFE_ADC_ONE_CAL_START        ((uint32_t)0x00830001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x830001</tt> */
#define MXC_R_AFE_ADC_ONE_GP0_CTRL         ((uint32_t)0x00840001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x840001</tt> */
#define MXC_R_AFE_ADC_ONE_GP1_CTRL         ((uint32_t)0x00850001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x850001</tt> */
#define MXC_R_AFE_ADC_ONE_GP_CONV          ((uint32_t)0x00860001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x860001</tt> */
#define MXC_R_AFE_ADC_ONE_GP_SEQ_ADDR      ((uint32_t)0x00870001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x870001</tt> */
#define MXC_R_AFE_ADC_ONE_FILTER           ((uint32_t)0x00880001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x880001</tt> */
#define MXC_R_AFE_ADC_ONE_CTRL             ((uint32_t)0x00890001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x890001</tt> */
#define MXC_R_AFE_ADC_ONE_SOURCE           ((uint32_t)0x008A0001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x8A0001</tt> */
#define MXC_R_AFE_ADC_ONE_MUX_CTRL0        ((uint32_t)0x008B0001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x8B0001</tt> */
#define MXC_R_AFE_ADC_ONE_MUX_CTRL1        ((uint32_t)0x008C0001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x8C0001</tt> */
#define MXC_R_AFE_ADC_ONE_MUX_CTRL2        ((uint32_t)0x008D0001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x8D0001</tt> */
#define MXC_R_AFE_ADC_ONE_PGA              ((uint32_t)0x008E0001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x8E0001</tt> */
#define MXC_R_AFE_ADC_ONE_WAIT_EXT         ((uint32_t)0x008F0001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x8F0001</tt> */
#define MXC_R_AFE_ADC_ONE_WAIT_START       ((uint32_t)0x00900001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x900001</tt> */
#define MXC_R_AFE_ADC_ONE_PART_ID          ((uint32_t)0x00910003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x910003</tt> */
#define MXC_R_AFE_ADC_ONE_SYSC_SEL         ((uint32_t)0x00920003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x920003</tt> */
#define MXC_R_AFE_ADC_ONE_SYS_OFF_A        ((uint32_t)0x00930003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x930003</tt> */
#define MXC_R_AFE_ADC_ONE_SYS_OFF_B        ((uint32_t)0x00940003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x940003</tt> */
#define MXC_R_AFE_ADC_ONE_SYS_GAIN_A       ((uint32_t)0x00950003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x950003</tt> */
#define MXC_R_AFE_ADC_ONE_SYS_GAIN_B       ((uint32_t)0x00960003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x960003</tt> */
#define MXC_R_AFE_ADC_ONE_SELF_OFF         ((uint32_t)0x00970003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x970003</tt> */
#define MXC_R_AFE_ADC_ONE_SELF_GAIN_1      ((uint32_t)0x00980003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x980003</tt> */
#define MXC_R_AFE_ADC_ONE_SELF_GAIN_2      ((uint32_t)0x00990003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x990003</tt> */
#define MXC_R_AFE_ADC_ONE_SELF_GAIN_4      ((uint32_t)0x009A0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x9A0003</tt> */
#define MXC_R_AFE_ADC_ONE_SELF_GAIN_8      ((uint32_t)0x009B0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x9B0003</tt> */
#define MXC_R_AFE_ADC_ONE_SELF_GAIN_16     ((uint32_t)0x009C0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x9C0003</tt> */
#define MXC_R_AFE_ADC_ONE_SELF_GAIN_32     ((uint32_t)0x009D0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x9D0003</tt> */
#define MXC_R_AFE_ADC_ONE_SELF_GAIN_64     ((uint32_t)0x009E0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x9E0003</tt> */
#define MXC_R_AFE_ADC_ONE_SELF_GAIN_128    ((uint32_t)0x009F0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0x9F0003</tt> */
#define MXC_R_AFE_ADC_ONE_LTHRESH0         ((uint32_t)0x00A00003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xA00003</tt> */
#define MXC_R_AFE_ADC_ONE_LTHRESH1         ((uint32_t)0x00A10003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xA10003</tt> */
#define MXC_R_AFE_ADC_ONE_LTHRESH2         ((uint32_t)0x00A20003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xA20003</tt> */
#define MXC_R_AFE_ADC_ONE_LTHRESH3         ((uint32_t)0x00A30003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xA30003</tt> */
#define MXC_R_AFE_ADC_ONE_LTHRESH4         ((uint32_t)0x00A40003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xA40003</tt> */
#define MXC_R_AFE_ADC_ONE_LTHRESH5         ((uint32_t)0x00A50003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xA50003</tt> */
#define MXC_R_AFE_ADC_ONE_LTHRESH6         ((uint32_t)0x00A60003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xA60003</tt> */
#define MXC_R_AFE_ADC_ONE_LTHRESH7         ((uint32_t)0x00A70003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xA70003</tt> */
#define MXC_R_AFE_ADC_ONE_UTHRESH0         ((uint32_t)0x00A80003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xA80003</tt> */
#define MXC_R_AFE_ADC_ONE_UTHRESH1         ((uint32_t)0x00A90003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xA90003</tt> */
#define MXC_R_AFE_ADC_ONE_UTHRESH2         ((uint32_t)0x00AA0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xAA0003</tt> */
#define MXC_R_AFE_ADC_ONE_UTHRESH3         ((uint32_t)0x00AB0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xAB0003</tt> */
#define MXC_R_AFE_ADC_ONE_UTHRESH4         ((uint32_t)0x00AC0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xAC0003</tt> */
#define MXC_R_AFE_ADC_ONE_UTHRESH5         ((uint32_t)0x00AD0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xAD0003</tt> */
#define MXC_R_AFE_ADC_ONE_UTHRESH6         ((uint32_t)0x00AE0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xAE0003</tt> */
#define MXC_R_AFE_ADC_ONE_UTHRESH7         ((uint32_t)0x00AF0003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xAF0003</tt> */
#define MXC_R_AFE_ADC_ONE_DATA0            ((uint32_t)0x00B00003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xB00003</tt> */
#define MXC_R_AFE_ADC_ONE_DATA1            ((uint32_t)0x00B10003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xB10003</tt> */
#define MXC_R_AFE_ADC_ONE_DATA2            ((uint32_t)0x00B20003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xB20003</tt> */
#define MXC_R_AFE_ADC_ONE_DATA3            ((uint32_t)0x00B30003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xB30003</tt> */
#define MXC_R_AFE_ADC_ONE_DATA4            ((uint32_t)0x00B40003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xB40003</tt> */
#define MXC_R_AFE_ADC_ONE_DATA5            ((uint32_t)0x00B50003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xB50003</tt> */
#define MXC_R_AFE_ADC_ONE_DATA6            ((uint32_t)0x00B60003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xB60003</tt> */
#define MXC_R_AFE_ADC_ONE_DATA7            ((uint32_t)0x00B70003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xB70003</tt> */
#define MXC_R_AFE_ADC_ONE_STATUS           ((uint32_t)0x00B80003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xB80003</tt> */
#define MXC_R_AFE_ADC_ONE_STATUS_IE        ((uint32_t)0x00B90003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xB90003</tt> */
#define MXC_R_AFE_ADC_ONE_UC_0             ((uint32_t)0x00BA0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xBA0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_1             ((uint32_t)0x00BB0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xBB0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_2             ((uint32_t)0x00BC0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xBC0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_3             ((uint32_t)0x00BD0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xBD0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_4             ((uint32_t)0x00BE0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xBE0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_5             ((uint32_t)0x00BF0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xBF0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_6             ((uint32_t)0x00C00002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xC00002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_7             ((uint32_t)0x00C10002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xC10002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_8             ((uint32_t)0x00C20002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xC20002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_9             ((uint32_t)0x00C30002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xC30002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_10            ((uint32_t)0x00C40002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xC40002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_11            ((uint32_t)0x00C50002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xC50002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_12            ((uint32_t)0x00C60002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xC60002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_13            ((uint32_t)0x00C70002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xC70002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_14            ((uint32_t)0x00C80002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xC80002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_15            ((uint32_t)0x00C90002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xC90002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_16            ((uint32_t)0x00CA0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xCA0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_17            ((uint32_t)0x00CB0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xCB0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_18            ((uint32_t)0x00CC0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xCC0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_19            ((uint32_t)0x00CD0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xCD0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_20            ((uint32_t)0x00CE0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xCE0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_21            ((uint32_t)0x00CF0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xCF0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_22            ((uint32_t)0x00D00002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xD00002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_23            ((uint32_t)0x00D10002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xD10002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_24            ((uint32_t)0x00D20002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xD20002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_25            ((uint32_t)0x00D30002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xD30002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_26            ((uint32_t)0x00D40002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xD40002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_27            ((uint32_t)0x00D50002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xD50002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_28            ((uint32_t)0x00D60002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xD60002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_29            ((uint32_t)0x00D70002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xD70002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_30            ((uint32_t)0x00D80002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xD80002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_31            ((uint32_t)0x00D90002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xD90002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_32            ((uint32_t)0x00DA0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xDA0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_33            ((uint32_t)0x00DB0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xDB0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_34            ((uint32_t)0x00DC0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xDC0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_35            ((uint32_t)0x00DD0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xDD0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_36            ((uint32_t)0x00DE0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xDE0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_37            ((uint32_t)0x00DF0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xDF0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_38            ((uint32_t)0x00E00002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xE00002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_39            ((uint32_t)0x00E10002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xE10002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_40            ((uint32_t)0x00E20002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xE20002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_41            ((uint32_t)0x00E30002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xE30002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_42            ((uint32_t)0x00E40002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xE40002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_43            ((uint32_t)0x00E50002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xE50002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_44            ((uint32_t)0x00E60002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xE60002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_45            ((uint32_t)0x00E70002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xE70002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_46            ((uint32_t)0x00E80002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xE80002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_47            ((uint32_t)0x00E90002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xE90002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_48            ((uint32_t)0x00EA0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xEA0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_49            ((uint32_t)0x00EB0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xEB0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_50            ((uint32_t)0x00EC0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xEC0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_51            ((uint32_t)0x00ED0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xED0002</tt> */
#define MXC_R_AFE_ADC_ONE_UC_52            ((uint32_t)0x00EE0002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xEE0002</tt> */
#define MXC_R_AFE_ADC_ONE_UCADDR           ((uint32_t)0x00EF0001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xEF0001</tt> */
#define MXC_R_AFE_ADC_ONE_FT_PWORD         ((uint32_t)0x00F00001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xF00001</tt> */
#define MXC_R_AFE_ADC_ONE_ADC_TRIM0        ((uint32_t)0x00F70003UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xF70003</tt> */
#define MXC_R_AFE_ADC_ONE_ADC_TRIM1        ((uint32_t)0x00F80002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xF80002</tt> */
#define MXC_R_AFE_ADC_ONE_ANA_TRIM         ((uint32_t)0x00F90002UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xF90002</tt> */
#define MXC_R_AFE_ADC_ONE_SYS_CTRL         ((uint32_t)0x00FA0001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xFA0001</tt> */
#define MXC_R_AFE_ADC_ONE_TS_CTRL          ((uint32_t)0x00FC0001UL) /**< Offset from AFE_ADC_ONE Base Address: <tt> 0xFC0001</tt> */
/**@} end of group afe_adc_one_registers */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_PD AFE_ADC_ONE_PD
 * @brief    Power down
 * @{
 */
#define MXC_F_AFE_ADC_ONE_PD_PD_POS                    0 /**< PD_PD Position */
#define MXC_F_AFE_ADC_ONE_PD_PD                        ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ONE_PD_PD_POS)) /**< PD_PD Mask */
#define MXC_V_AFE_ADC_ONE_PD_PD_NORMAL_MODE            ((uint8_t)0x0UL) /**< PD_PD_NORMAL_MODE Value */
#define MXC_S_AFE_ADC_ONE_PD_PD_NORMAL_MODE            (MXC_V_AFE_ADC_ONE_PD_PD_NORMAL_MODE << MXC_F_AFE_ADC_ONE_PD_PD_POS) /**< PD_PD_NORMAL_MODE Setting */
#define MXC_V_AFE_ADC_ONE_PD_PD_STANDBY_MODE           ((uint8_t)0x1UL) /**< PD_PD_STANDBY_MODE Value */
#define MXC_S_AFE_ADC_ONE_PD_PD_STANDBY_MODE           (MXC_V_AFE_ADC_ONE_PD_PD_STANDBY_MODE << MXC_F_AFE_ADC_ONE_PD_PD_POS) /**< PD_PD_STANDBY_MODE Setting */
#define MXC_V_AFE_ADC_ONE_PD_PD_SLEEP_MODE             ((uint8_t)0x2UL) /**< PD_PD_SLEEP_MODE Value */
#define MXC_S_AFE_ADC_ONE_PD_PD_SLEEP_MODE             (MXC_V_AFE_ADC_ONE_PD_PD_SLEEP_MODE << MXC_F_AFE_ADC_ONE_PD_PD_POS) /**< PD_PD_SLEEP_MODE Setting */
#define MXC_V_AFE_ADC_ONE_PD_PD_RESET                  ((uint8_t)0x3UL) /**< PD_PD_RESET Value */
#define MXC_S_AFE_ADC_ONE_PD_PD_RESET                  (MXC_V_AFE_ADC_ONE_PD_PD_RESET << MXC_F_AFE_ADC_ONE_PD_PD_POS) /**< PD_PD_RESET Setting */

/**@} end of group AFE_ADC_ONE_PD_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_CONV_START AFE_ADC_ONE_CONV_START
 * @brief    Initiate conversions
 * @{
 */
#define MXC_F_AFE_ADC_ONE_CONV_START_CONV_TYPE_POS     0 /**< CONV_START_CONV_TYPE Position */
#define MXC_F_AFE_ADC_ONE_CONV_START_CONV_TYPE         ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ONE_CONV_START_CONV_TYPE_POS)) /**< CONV_START_CONV_TYPE Mask */
#define MXC_V_AFE_ADC_ONE_CONV_START_CONV_TYPE_SINGLE  ((uint8_t)0x0UL) /**< CONV_START_CONV_TYPE_SINGLE Value */
#define MXC_S_AFE_ADC_ONE_CONV_START_CONV_TYPE_SINGLE  (MXC_V_AFE_ADC_ONE_CONV_START_CONV_TYPE_SINGLE << MXC_F_AFE_ADC_ONE_CONV_START_CONV_TYPE_POS) /**< CONV_START_CONV_TYPE_SINGLE Setting */
#define MXC_V_AFE_ADC_ONE_CONV_START_CONV_TYPE_CONTINUOUS ((uint8_t)0x1UL) /**< CONV_START_CONV_TYPE_CONTINUOUS Value */
#define MXC_S_AFE_ADC_ONE_CONV_START_CONV_TYPE_CONTINUOUS (MXC_V_AFE_ADC_ONE_CONV_START_CONV_TYPE_CONTINUOUS << MXC_F_AFE_ADC_ONE_CONV_START_CONV_TYPE_POS) /**< CONV_START_CONV_TYPE_CONTINUOUS Setting */
#define MXC_V_AFE_ADC_ONE_CONV_START_CONV_TYPE_DUTY_CYCLED_1_TO_4 ((uint8_t)0x2UL) /**< CONV_START_CONV_TYPE_DUTY_CYCLED_1_TO_4 Value */
#define MXC_S_AFE_ADC_ONE_CONV_START_CONV_TYPE_DUTY_CYCLED_1_TO_4 (MXC_V_AFE_ADC_ONE_CONV_START_CONV_TYPE_DUTY_CYCLED_1_TO_4 << MXC_F_AFE_ADC_ONE_CONV_START_CONV_TYPE_POS) /**< CONV_START_CONV_TYPE_DUTY_CYCLED_1_TO_4 Setting */

#define MXC_F_AFE_ADC_ONE_CONV_START_DEST_POS          4 /**< CONV_START_DEST Position */
#define MXC_F_AFE_ADC_ONE_CONV_START_DEST              ((uint8_t)(0x7UL << MXC_F_AFE_ADC_ONE_CONV_START_DEST_POS)) /**< CONV_START_DEST Mask */

/**@} end of group AFE_ADC_ONE_CONV_START_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SEQ_START AFE_ADC_ONE_SEQ_START
 * @brief    Execute a sequence at written address (0x3A to 0x6E)
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SEQ_START_SEQ_ADDRESS_POS    0 /**< SEQ_START_SEQ_ADDRESS Position */
#define MXC_F_AFE_ADC_ONE_SEQ_START_SEQ_ADDRESS        ((uint8_t)(0xFFUL << MXC_F_AFE_ADC_ONE_SEQ_START_SEQ_ADDRESS_POS)) /**< SEQ_START_SEQ_ADDRESS Mask */

/**@} end of group AFE_ADC_ONE_SEQ_START_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_CAL_START AFE_ADC_ONE_CAL_START
 * @brief    Execute selected calibration
 * @{
 */
#define MXC_F_AFE_ADC_ONE_CAL_START_CAL_TYPE_POS       0 /**< CAL_START_CAL_TYPE Position */
#define MXC_F_AFE_ADC_ONE_CAL_START_CAL_TYPE           ((uint8_t)(0x7UL << MXC_F_AFE_ADC_ONE_CAL_START_CAL_TYPE_POS)) /**< CAL_START_CAL_TYPE Mask */

/**@} end of group AFE_ADC_ONE_CAL_START_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_GP0_CTRL AFE_ADC_ONE_GP0_CTRL
 * @brief    Control behavior of GPIO0
 * @{
 */
#define MXC_F_AFE_ADC_ONE_GP0_CTRL_GP0_OSEL_POS        0 /**< GP0_CTRL_GP0_OSEL Position */
#define MXC_F_AFE_ADC_ONE_GP0_CTRL_GP0_OSEL            ((uint8_t)(0x7UL << MXC_F_AFE_ADC_ONE_GP0_CTRL_GP0_OSEL_POS)) /**< GP0_CTRL_GP0_OSEL Mask */

