analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_one_regs.h
/**@} end of group AFE_ADC_ONE_UTHRESH0_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UTHRESH1 AFE_ADC_ONE_UTHRESH1
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UTHRESH1_UTHRESH_POS         0 /**< UTHRESH1_UTHRESH Position */
#define MXC_F_AFE_ADC_ONE_UTHRESH1_UTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_UTHRESH1_UTHRESH_POS)) /**< UTHRESH1_UTHRESH Mask */

/**@} end of group AFE_ADC_ONE_UTHRESH1_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UTHRESH2 AFE_ADC_ONE_UTHRESH2
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UTHRESH2_UTHRESH_POS         0 /**< UTHRESH2_UTHRESH Position */
#define MXC_F_AFE_ADC_ONE_UTHRESH2_UTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_UTHRESH2_UTHRESH_POS)) /**< UTHRESH2_UTHRESH Mask */

/**@} end of group AFE_ADC_ONE_UTHRESH2_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UTHRESH3 AFE_ADC_ONE_UTHRESH3
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UTHRESH3_UTHRESH_POS         0 /**< UTHRESH3_UTHRESH Position */
#define MXC_F_AFE_ADC_ONE_UTHRESH3_UTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_UTHRESH3_UTHRESH_POS)) /**< UTHRESH3_UTHRESH Mask */

/**@} end of group AFE_ADC_ONE_UTHRESH3_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UTHRESH4 AFE_ADC_ONE_UTHRESH4
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UTHRESH4_UTHRESH_POS         0 /**< UTHRESH4_UTHRESH Position */
#define MXC_F_AFE_ADC_ONE_UTHRESH4_UTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_UTHRESH4_UTHRESH_POS)) /**< UTHRESH4_UTHRESH Mask */

/**@} end of group AFE_ADC_ONE_UTHRESH4_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UTHRESH5 AFE_ADC_ONE_UTHRESH5
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UTHRESH5_UTHRESH_POS         0 /**< UTHRESH5_UTHRESH Position */
#define MXC_F_AFE_ADC_ONE_UTHRESH5_UTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_UTHRESH5_UTHRESH_POS)) /**< UTHRESH5_UTHRESH Mask */

/**@} end of group AFE_ADC_ONE_UTHRESH5_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UTHRESH6 AFE_ADC_ONE_UTHRESH6
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UTHRESH6_UTHRESH_POS         0 /**< UTHRESH6_UTHRESH Position */
#define MXC_F_AFE_ADC_ONE_UTHRESH6_UTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_UTHRESH6_UTHRESH_POS)) /**< UTHRESH6_UTHRESH Mask */

/**@} end of group AFE_ADC_ONE_UTHRESH6_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UTHRESH7 AFE_ADC_ONE_UTHRESH7
 * @brief    Upper comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UTHRESH7_UTHRESH_POS         0 /**< UTHRESH7_UTHRESH Position */
#define MXC_F_AFE_ADC_ONE_UTHRESH7_UTHRESH             ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_UTHRESH7_UTHRESH_POS)) /**< UTHRESH7_UTHRESH Mask */

/**@} end of group AFE_ADC_ONE_UTHRESH7_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_DATA0 AFE_ADC_ONE_DATA0
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ONE_DATA0_DATA0_POS              0 /**< DATA0_DATA0 Position */
#define MXC_F_AFE_ADC_ONE_DATA0_DATA0                  ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_DATA0_DATA0_POS)) /**< DATA0_DATA0 Mask */

/**@} end of group AFE_ADC_ONE_DATA0_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_DATA1 AFE_ADC_ONE_DATA1
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ONE_DATA1_DATA1_POS              0 /**< DATA1_DATA1 Position */
#define MXC_F_AFE_ADC_ONE_DATA1_DATA1                  ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_DATA1_DATA1_POS)) /**< DATA1_DATA1 Mask */

/**@} end of group AFE_ADC_ONE_DATA1_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_DATA2 AFE_ADC_ONE_DATA2
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ONE_DATA2_DATA2_POS              0 /**< DATA2_DATA2 Position */
#define MXC_F_AFE_ADC_ONE_DATA2_DATA2                  ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_DATA2_DATA2_POS)) /**< DATA2_DATA2 Mask */

/**@} end of group AFE_ADC_ONE_DATA2_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_DATA3 AFE_ADC_ONE_DATA3
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ONE_DATA3_DATA3_POS              0 /**< DATA3_DATA3 Position */
#define MXC_F_AFE_ADC_ONE_DATA3_DATA3                  ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_DATA3_DATA3_POS)) /**< DATA3_DATA3 Mask */

/**@} end of group AFE_ADC_ONE_DATA3_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_DATA4 AFE_ADC_ONE_DATA4
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ONE_DATA4_DATA4_POS              0 /**< DATA4_DATA4 Position */
#define MXC_F_AFE_ADC_ONE_DATA4_DATA4                  ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_DATA4_DATA4_POS)) /**< DATA4_DATA4 Mask */

/**@} end of group AFE_ADC_ONE_DATA4_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_DATA5 AFE_ADC_ONE_DATA5
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ONE_DATA5_DATA5_POS              0 /**< DATA5_DATA5 Position */
#define MXC_F_AFE_ADC_ONE_DATA5_DATA5                  ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_DATA5_DATA5_POS)) /**< DATA5_DATA5 Mask */

/**@} end of group AFE_ADC_ONE_DATA5_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_DATA6 AFE_ADC_ONE_DATA6
 * @brief    ADC conversion result storage
 * @{
 */
#define MXC_F_AFE_ADC_ONE_DATA6_DATA6_POS              0 /**< DATA6_DATA6 Position */
#define MXC_F_AFE_ADC_ONE_DATA6_DATA6                  ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ONE_DATA6_DATA6_POS)) /**< DATA6_DATA6 Mask */

