analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_one_regs.h
/**@} end of group AFE_ADC_ONE_UC_1_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_2 AFE_ADC_ONE_UC_2
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_2_REG_DATA_POS            0 /**< UC_2_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_2_REG_DATA                ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_2_REG_DATA_POS)) /**< UC_2_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_2_REG_ADDR_POS            8 /**< UC_2_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_2_REG_ADDR                ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_2_REG_ADDR_POS)) /**< UC_2_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_2_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_3 AFE_ADC_ONE_UC_3
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_3_REG_DATA_POS            0 /**< UC_3_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_3_REG_DATA                ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_3_REG_DATA_POS)) /**< UC_3_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_3_REG_ADDR_POS            8 /**< UC_3_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_3_REG_ADDR                ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_3_REG_ADDR_POS)) /**< UC_3_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_3_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_4 AFE_ADC_ONE_UC_4
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_4_REG_DATA_POS            0 /**< UC_4_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_4_REG_DATA                ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_4_REG_DATA_POS)) /**< UC_4_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_4_REG_ADDR_POS            8 /**< UC_4_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_4_REG_ADDR                ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_4_REG_ADDR_POS)) /**< UC_4_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_4_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_5 AFE_ADC_ONE_UC_5
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_5_REG_DATA_POS            0 /**< UC_5_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_5_REG_DATA                ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_5_REG_DATA_POS)) /**< UC_5_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_5_REG_ADDR_POS            8 /**< UC_5_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_5_REG_ADDR                ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_5_REG_ADDR_POS)) /**< UC_5_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_5_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_6 AFE_ADC_ONE_UC_6
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_6_REG_DATA_POS            0 /**< UC_6_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_6_REG_DATA                ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_6_REG_DATA_POS)) /**< UC_6_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_6_REG_ADDR_POS            8 /**< UC_6_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_6_REG_ADDR                ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_6_REG_ADDR_POS)) /**< UC_6_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_6_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_7 AFE_ADC_ONE_UC_7
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_7_REG_DATA_POS            0 /**< UC_7_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_7_REG_DATA                ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_7_REG_DATA_POS)) /**< UC_7_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_7_REG_ADDR_POS            8 /**< UC_7_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_7_REG_ADDR                ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_7_REG_ADDR_POS)) /**< UC_7_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_7_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_8 AFE_ADC_ONE_UC_8
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_8_REG_DATA_POS            0 /**< UC_8_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_8_REG_DATA                ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_8_REG_DATA_POS)) /**< UC_8_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_8_REG_ADDR_POS            8 /**< UC_8_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_8_REG_ADDR                ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_8_REG_ADDR_POS)) /**< UC_8_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_8_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_9 AFE_ADC_ONE_UC_9
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_9_REG_DATA_POS            0 /**< UC_9_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_9_REG_DATA                ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_9_REG_DATA_POS)) /**< UC_9_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_9_REG_ADDR_POS            8 /**< UC_9_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_9_REG_ADDR                ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_9_REG_ADDR_POS)) /**< UC_9_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_9_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_10 AFE_ADC_ONE_UC_10
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_10_REG_DATA_POS           0 /**< UC_10_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_10_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_10_REG_DATA_POS)) /**< UC_10_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_10_REG_ADDR_POS           8 /**< UC_10_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_10_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_10_REG_ADDR_POS)) /**< UC_10_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_10_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_11 AFE_ADC_ONE_UC_11
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_11_REG_DATA_POS           0 /**< UC_11_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_11_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_11_REG_DATA_POS)) /**< UC_11_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_11_REG_ADDR_POS           8 /**< UC_11_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_11_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_11_REG_ADDR_POS)) /**< UC_11_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_11_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_12 AFE_ADC_ONE_UC_12
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_12_REG_DATA_POS           0 /**< UC_12_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_12_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_12_REG_DATA_POS)) /**< UC_12_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_12_REG_ADDR_POS           8 /**< UC_12_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_12_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_12_REG_ADDR_POS)) /**< UC_12_REG_ADDR Mask */

