analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_one_regs.h
/**@} end of group AFE_ADC_ONE_UC_12_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_13 AFE_ADC_ONE_UC_13
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_13_REG_DATA_POS           0 /**< UC_13_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_13_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_13_REG_DATA_POS)) /**< UC_13_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_13_REG_ADDR_POS           8 /**< UC_13_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_13_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_13_REG_ADDR_POS)) /**< UC_13_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_13_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_14 AFE_ADC_ONE_UC_14
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_14_REG_DATA_POS           0 /**< UC_14_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_14_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_14_REG_DATA_POS)) /**< UC_14_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_14_REG_ADDR_POS           8 /**< UC_14_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_14_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_14_REG_ADDR_POS)) /**< UC_14_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_14_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_15 AFE_ADC_ONE_UC_15
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_15_REG_DATA_POS           0 /**< UC_15_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_15_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_15_REG_DATA_POS)) /**< UC_15_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_15_REG_ADDR_POS           8 /**< UC_15_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_15_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_15_REG_ADDR_POS)) /**< UC_15_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_15_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_16 AFE_ADC_ONE_UC_16
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_16_REG_DATA_POS           0 /**< UC_16_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_16_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_16_REG_DATA_POS)) /**< UC_16_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_16_REG_ADDR_POS           8 /**< UC_16_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_16_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_16_REG_ADDR_POS)) /**< UC_16_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_16_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_17 AFE_ADC_ONE_UC_17
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_17_REG_DATA_POS           0 /**< UC_17_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_17_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_17_REG_DATA_POS)) /**< UC_17_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_17_REG_ADDR_POS           8 /**< UC_17_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_17_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_17_REG_ADDR_POS)) /**< UC_17_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_17_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_18 AFE_ADC_ONE_UC_18
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_18_REG_DATA_POS           0 /**< UC_18_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_18_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_18_REG_DATA_POS)) /**< UC_18_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_18_REG_ADDR_POS           8 /**< UC_18_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_18_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_18_REG_ADDR_POS)) /**< UC_18_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_18_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_19 AFE_ADC_ONE_UC_19
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_19_REG_DATA_POS           0 /**< UC_19_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_19_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_19_REG_DATA_POS)) /**< UC_19_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_19_REG_ADDR_POS           8 /**< UC_19_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_19_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_19_REG_ADDR_POS)) /**< UC_19_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_19_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_20 AFE_ADC_ONE_UC_20
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_20_REG_DATA_POS           0 /**< UC_20_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_20_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_20_REG_DATA_POS)) /**< UC_20_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_20_REG_ADDR_POS           8 /**< UC_20_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_20_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_20_REG_ADDR_POS)) /**< UC_20_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_20_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_21 AFE_ADC_ONE_UC_21
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_21_REG_DATA_POS           0 /**< UC_21_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_21_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_21_REG_DATA_POS)) /**< UC_21_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_21_REG_ADDR_POS           8 /**< UC_21_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_21_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_21_REG_ADDR_POS)) /**< UC_21_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_21_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_22 AFE_ADC_ONE_UC_22
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_22_REG_DATA_POS           0 /**< UC_22_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_22_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_22_REG_DATA_POS)) /**< UC_22_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_22_REG_ADDR_POS           8 /**< UC_22_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_22_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_22_REG_ADDR_POS)) /**< UC_22_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_22_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_23 AFE_ADC_ONE_UC_23
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_23_REG_DATA_POS           0 /**< UC_23_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_23_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_23_REG_DATA_POS)) /**< UC_23_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_23_REG_ADDR_POS           8 /**< UC_23_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_23_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_23_REG_ADDR_POS)) /**< UC_23_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_23_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_24 AFE_ADC_ONE_UC_24
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_24_REG_DATA_POS           0 /**< UC_24_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_24_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_24_REG_DATA_POS)) /**< UC_24_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_24_REG_ADDR_POS           8 /**< UC_24_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_24_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_24_REG_ADDR_POS)) /**< UC_24_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_24_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_25 AFE_ADC_ONE_UC_25
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_25_REG_DATA_POS           0 /**< UC_25_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_25_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_25_REG_DATA_POS)) /**< UC_25_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_25_REG_ADDR_POS           8 /**< UC_25_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_25_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_25_REG_ADDR_POS)) /**< UC_25_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_25_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_26 AFE_ADC_ONE_UC_26
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_26_REG_DATA_POS           0 /**< UC_26_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_26_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_26_REG_DATA_POS)) /**< UC_26_REG_DATA Mask */

