analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_one_regs.h
#define MXC_F_AFE_ADC_ONE_UC_26_REG_ADDR_POS           8 /**< UC_26_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_26_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_26_REG_ADDR_POS)) /**< UC_26_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_26_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_27 AFE_ADC_ONE_UC_27
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_27_REG_DATA_POS           0 /**< UC_27_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_27_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_27_REG_DATA_POS)) /**< UC_27_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_27_REG_ADDR_POS           8 /**< UC_27_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_27_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_27_REG_ADDR_POS)) /**< UC_27_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_27_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_28 AFE_ADC_ONE_UC_28
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_28_REG_DATA_POS           0 /**< UC_28_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_28_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_28_REG_DATA_POS)) /**< UC_28_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_28_REG_ADDR_POS           8 /**< UC_28_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_28_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_28_REG_ADDR_POS)) /**< UC_28_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_28_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_29 AFE_ADC_ONE_UC_29
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_29_REG_DATA_POS           0 /**< UC_29_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_29_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_29_REG_DATA_POS)) /**< UC_29_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_29_REG_ADDR_POS           8 /**< UC_29_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_29_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_29_REG_ADDR_POS)) /**< UC_29_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_29_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_30 AFE_ADC_ONE_UC_30
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_30_REG_DATA_POS           0 /**< UC_30_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_30_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_30_REG_DATA_POS)) /**< UC_30_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_30_REG_ADDR_POS           8 /**< UC_30_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_30_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_30_REG_ADDR_POS)) /**< UC_30_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_30_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_31 AFE_ADC_ONE_UC_31
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_31_REG_DATA_POS           0 /**< UC_31_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_31_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_31_REG_DATA_POS)) /**< UC_31_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_31_REG_ADDR_POS           8 /**< UC_31_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_31_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_31_REG_ADDR_POS)) /**< UC_31_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_31_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_32 AFE_ADC_ONE_UC_32
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_32_REG_DATA_POS           0 /**< UC_32_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_32_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_32_REG_DATA_POS)) /**< UC_32_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_32_REG_ADDR_POS           8 /**< UC_32_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_32_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_32_REG_ADDR_POS)) /**< UC_32_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_32_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_33 AFE_ADC_ONE_UC_33
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_33_REG_DATA_POS           0 /**< UC_33_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_33_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_33_REG_DATA_POS)) /**< UC_33_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_33_REG_ADDR_POS           8 /**< UC_33_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_33_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_33_REG_ADDR_POS)) /**< UC_33_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_33_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_34 AFE_ADC_ONE_UC_34
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_34_REG_DATA_POS           0 /**< UC_34_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_34_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_34_REG_DATA_POS)) /**< UC_34_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_34_REG_ADDR_POS           8 /**< UC_34_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_34_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_34_REG_ADDR_POS)) /**< UC_34_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_34_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_35 AFE_ADC_ONE_UC_35
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_35_REG_DATA_POS           0 /**< UC_35_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_35_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_35_REG_DATA_POS)) /**< UC_35_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_35_REG_ADDR_POS           8 /**< UC_35_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_35_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_35_REG_ADDR_POS)) /**< UC_35_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_35_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_36 AFE_ADC_ONE_UC_36
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_36_REG_DATA_POS           0 /**< UC_36_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_36_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_36_REG_DATA_POS)) /**< UC_36_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_36_REG_ADDR_POS           8 /**< UC_36_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_36_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_36_REG_ADDR_POS)) /**< UC_36_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_36_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_37 AFE_ADC_ONE_UC_37
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_37_REG_DATA_POS           0 /**< UC_37_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_37_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_37_REG_DATA_POS)) /**< UC_37_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_37_REG_ADDR_POS           8 /**< UC_37_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_37_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_37_REG_ADDR_POS)) /**< UC_37_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_37_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_38 AFE_ADC_ONE_UC_38
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_38_REG_DATA_POS           0 /**< UC_38_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_38_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_38_REG_DATA_POS)) /**< UC_38_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_38_REG_ADDR_POS           8 /**< UC_38_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_38_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_38_REG_ADDR_POS)) /**< UC_38_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_38_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_39 AFE_ADC_ONE_UC_39
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_39_REG_DATA_POS           0 /**< UC_39_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_39_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_39_REG_DATA_POS)) /**< UC_39_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_39_REG_ADDR_POS           8 /**< UC_39_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_39_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_39_REG_ADDR_POS)) /**< UC_39_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_39_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_40 AFE_ADC_ONE_UC_40
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_40_REG_DATA_POS           0 /**< UC_40_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_40_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_40_REG_DATA_POS)) /**< UC_40_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_40_REG_ADDR_POS           8 /**< UC_40_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_40_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_40_REG_ADDR_POS)) /**< UC_40_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_40_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_41 AFE_ADC_ONE_UC_41
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_41_REG_DATA_POS           0 /**< UC_41_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_41_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_41_REG_DATA_POS)) /**< UC_41_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_41_REG_ADDR_POS           8 /**< UC_41_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_41_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_41_REG_ADDR_POS)) /**< UC_41_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_41_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_42 AFE_ADC_ONE_UC_42
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_42_REG_DATA_POS           0 /**< UC_42_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_42_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_42_REG_DATA_POS)) /**< UC_42_REG_DATA Mask */

