analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_one_regs.h
#define MXC_F_AFE_ADC_ONE_UC_42_REG_ADDR_POS           8 /**< UC_42_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_42_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_42_REG_ADDR_POS)) /**< UC_42_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_42_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_43 AFE_ADC_ONE_UC_43
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_43_REG_DATA_POS           0 /**< UC_43_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_43_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_43_REG_DATA_POS)) /**< UC_43_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_43_REG_ADDR_POS           8 /**< UC_43_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_43_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_43_REG_ADDR_POS)) /**< UC_43_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_43_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_44 AFE_ADC_ONE_UC_44
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_44_REG_DATA_POS           0 /**< UC_44_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_44_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_44_REG_DATA_POS)) /**< UC_44_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_44_REG_ADDR_POS           8 /**< UC_44_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_44_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_44_REG_ADDR_POS)) /**< UC_44_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_44_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_45 AFE_ADC_ONE_UC_45
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_45_REG_DATA_POS           0 /**< UC_45_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_45_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_45_REG_DATA_POS)) /**< UC_45_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_45_REG_ADDR_POS           8 /**< UC_45_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_45_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_45_REG_ADDR_POS)) /**< UC_45_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_45_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_46 AFE_ADC_ONE_UC_46
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_46_REG_DATA_POS           0 /**< UC_46_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_46_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_46_REG_DATA_POS)) /**< UC_46_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_46_REG_ADDR_POS           8 /**< UC_46_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_46_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_46_REG_ADDR_POS)) /**< UC_46_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_46_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_47 AFE_ADC_ONE_UC_47
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_47_REG_DATA_POS           0 /**< UC_47_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_47_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_47_REG_DATA_POS)) /**< UC_47_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_47_REG_ADDR_POS           8 /**< UC_47_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_47_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_47_REG_ADDR_POS)) /**< UC_47_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_47_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_48 AFE_ADC_ONE_UC_48
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_48_REG_DATA_POS           0 /**< UC_48_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_48_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_48_REG_DATA_POS)) /**< UC_48_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_48_REG_ADDR_POS           8 /**< UC_48_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_48_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_48_REG_ADDR_POS)) /**< UC_48_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_48_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_49 AFE_ADC_ONE_UC_49
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_49_REG_DATA_POS           0 /**< UC_49_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_49_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_49_REG_DATA_POS)) /**< UC_49_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_49_REG_ADDR_POS           8 /**< UC_49_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_49_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_49_REG_ADDR_POS)) /**< UC_49_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_49_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_50 AFE_ADC_ONE_UC_50
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_50_REG_DATA_POS           0 /**< UC_50_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_50_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_50_REG_DATA_POS)) /**< UC_50_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_50_REG_ADDR_POS           8 /**< UC_50_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_50_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_50_REG_ADDR_POS)) /**< UC_50_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_50_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_51 AFE_ADC_ONE_UC_51
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_51_REG_DATA_POS           0 /**< UC_51_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_51_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_51_REG_DATA_POS)) /**< UC_51_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_51_REG_ADDR_POS           8 /**< UC_51_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_51_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_51_REG_ADDR_POS)) /**< UC_51_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_51_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UC_52 AFE_ADC_ONE_UC_52
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UC_52_REG_DATA_POS           0 /**< UC_52_REG_DATA Position */
#define MXC_F_AFE_ADC_ONE_UC_52_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ONE_UC_52_REG_DATA_POS)) /**< UC_52_REG_DATA Mask */

#define MXC_F_AFE_ADC_ONE_UC_52_REG_ADDR_POS           8 /**< UC_52_REG_ADDR Position */
#define MXC_F_AFE_ADC_ONE_UC_52_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UC_52_REG_ADDR_POS)) /**< UC_52_REG_ADDR Mask */

/**@} end of group AFE_ADC_ONE_UC_52_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_UCADDR AFE_ADC_ONE_UCADDR
 * @brief    Address of currently executing sequence command
 * @{
 */
#define MXC_F_AFE_ADC_ONE_UCADDR_UCADDR_POS            0 /**< UCADDR_UCADDR Position */
#define MXC_F_AFE_ADC_ONE_UCADDR_UCADDR                ((uint8_t)(0x7FUL << MXC_F_AFE_ADC_ONE_UCADDR_UCADDR_POS)) /**< UCADDR_UCADDR Mask */

/**@} end of group AFE_ADC_ONE_UCADDR_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_FT_PWORD AFE_ADC_ONE_FT_PWORD
 * @brief    FT Password
 * @{
 */
#define MXC_F_AFE_ADC_ONE_FT_PWORD_FT_PWORD_POS        0 /**< FT_PWORD_FT_PWORD Position */
#define MXC_F_AFE_ADC_ONE_FT_PWORD_FT_PWORD            ((uint8_t)(0x7FUL << MXC_F_AFE_ADC_ONE_FT_PWORD_FT_PWORD_POS)) /**< FT_PWORD_FT_PWORD Mask */
#define MXC_V_AFE_ADC_ONE_FT_PWORD_FT_PWORD_PWORD_1    ((uint8_t)0x48UL) /**< FT_PWORD_FT_PWORD_PWORD_1 Value */
#define MXC_S_AFE_ADC_ONE_FT_PWORD_FT_PWORD_PWORD_1    (MXC_V_AFE_ADC_ONE_FT_PWORD_FT_PWORD_PWORD_1 << MXC_F_AFE_ADC_ONE_FT_PWORD_FT_PWORD_POS) /**< FT_PWORD_FT_PWORD_PWORD_1 Setting */
#define MXC_V_AFE_ADC_ONE_FT_PWORD_FT_PWORD_PWORD_2    ((uint8_t)0x7BUL) /**< FT_PWORD_FT_PWORD_PWORD_2 Value */
#define MXC_S_AFE_ADC_ONE_FT_PWORD_FT_PWORD_PWORD_2    (MXC_V_AFE_ADC_ONE_FT_PWORD_FT_PWORD_PWORD_2 << MXC_F_AFE_ADC_ONE_FT_PWORD_FT_PWORD_POS) /**< FT_PWORD_FT_PWORD_PWORD_2 Setting */

/**@} end of group AFE_ADC_ONE_FT_PWORD_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_ADC_TRIM0 AFE_ADC_ONE_ADC_TRIM0
 * @brief    Various ADC Analog Trims
 * @{
 */
#define MXC_F_AFE_ADC_ONE_ADC_TRIM0_VGB_TRIM_POS       0 /**< ADC_TRIM0_VGB_TRIM Position */
#define MXC_F_AFE_ADC_ONE_ADC_TRIM0_VGB_TRIM           ((uint32_t)(0x3FUL << MXC_F_AFE_ADC_ONE_ADC_TRIM0_VGB_TRIM_POS)) /**< ADC_TRIM0_VGB_TRIM Mask */

#define MXC_F_AFE_ADC_ONE_ADC_TRIM0_IP_TRIM_POS        6 /**< ADC_TRIM0_IP_TRIM Position */
#define MXC_F_AFE_ADC_ONE_ADC_TRIM0_IP_TRIM            ((uint32_t)(0x1FUL << MXC_F_AFE_ADC_ONE_ADC_TRIM0_IP_TRIM_POS)) /**< ADC_TRIM0_IP_TRIM Mask */

