analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32680/Include/afe_adc_one_regs.h
#define MXC_F_AFE_ADC_ONE_ADC_TRIM0_IB_TRIM_POS        11 /**< ADC_TRIM0_IB_TRIM Position */
#define MXC_F_AFE_ADC_ONE_ADC_TRIM0_IB_TRIM            ((uint32_t)(0x3FUL << MXC_F_AFE_ADC_ONE_ADC_TRIM0_IB_TRIM_POS)) /**< ADC_TRIM0_IB_TRIM Mask */

#define MXC_F_AFE_ADC_ONE_ADC_TRIM0_CLKSKEW_POS        17 /**< ADC_TRIM0_CLKSKEW Position */
#define MXC_F_AFE_ADC_ONE_ADC_TRIM0_CLKSKEW            ((uint32_t)(0x3UL << MXC_F_AFE_ADC_ONE_ADC_TRIM0_CLKSKEW_POS)) /**< ADC_TRIM0_CLKSKEW Mask */

/**@} end of group AFE_ADC_ONE_ADC_TRIM0_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_ADC_TRIM1 AFE_ADC_ONE_ADC_TRIM1
 * @brief    Various ADC Analog Trims
 * @{
 */
#define MXC_F_AFE_ADC_ONE_ADC_TRIM1_IDAC0_TRIM_POS     0 /**< ADC_TRIM1_IDAC0_TRIM Position */
#define MXC_F_AFE_ADC_ONE_ADC_TRIM1_IDAC0_TRIM         ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_ADC_TRIM1_IDAC0_TRIM_POS)) /**< ADC_TRIM1_IDAC0_TRIM Mask */

#define MXC_F_AFE_ADC_ONE_ADC_TRIM1_IDAC1_TRIM_POS     7 /**< ADC_TRIM1_IDAC1_TRIM Position */
#define MXC_F_AFE_ADC_ONE_ADC_TRIM1_IDAC1_TRIM         ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ONE_ADC_TRIM1_IDAC1_TRIM_POS)) /**< ADC_TRIM1_IDAC1_TRIM Mask */

/**@} end of group AFE_ADC_ONE_ADC_TRIM1_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_ANA_TRIM AFE_ADC_ONE_ANA_TRIM
 * @brief    Various Analog Trims
 * @{
 */
#define MXC_F_AFE_ADC_ONE_ANA_TRIM_LDO_TRIM_POS        0 /**< ANA_TRIM_LDO_TRIM Position */
#define MXC_F_AFE_ADC_ONE_ANA_TRIM_LDO_TRIM            ((uint16_t)(0xFUL << MXC_F_AFE_ADC_ONE_ANA_TRIM_LDO_TRIM_POS)) /**< ANA_TRIM_LDO_TRIM Mask */

#define MXC_F_AFE_ADC_ONE_ANA_TRIM_OSC_TRIM_POS        4 /**< ANA_TRIM_OSC_TRIM Position */
#define MXC_F_AFE_ADC_ONE_ANA_TRIM_OSC_TRIM            ((uint16_t)(0x3FUL << MXC_F_AFE_ADC_ONE_ANA_TRIM_OSC_TRIM_POS)) /**< ANA_TRIM_OSC_TRIM Mask */

#define MXC_F_AFE_ADC_ONE_ANA_TRIM_OSC_FSEL_POS        10 /**< ANA_TRIM_OSC_FSEL Position */
#define MXC_F_AFE_ADC_ONE_ANA_TRIM_OSC_FSEL            ((uint16_t)(0x3UL << MXC_F_AFE_ADC_ONE_ANA_TRIM_OSC_FSEL_POS)) /**< ANA_TRIM_OSC_FSEL Mask */

#define MXC_F_AFE_ADC_ONE_ANA_TRIM_PKG_TRIM_POS        12 /**< ANA_TRIM_PKG_TRIM Position */
#define MXC_F_AFE_ADC_ONE_ANA_TRIM_PKG_TRIM            ((uint16_t)(0x3UL << MXC_F_AFE_ADC_ONE_ANA_TRIM_PKG_TRIM_POS)) /**< ANA_TRIM_PKG_TRIM Mask */

#define MXC_F_AFE_ADC_ONE_ANA_TRIM_RES_TRIM_POS        14 /**< ANA_TRIM_RES_TRIM Position */
#define MXC_F_AFE_ADC_ONE_ANA_TRIM_RES_TRIM            ((uint16_t)(0x1UL << MXC_F_AFE_ADC_ONE_ANA_TRIM_RES_TRIM_POS)) /**< ANA_TRIM_RES_TRIM Mask */

/**@} end of group AFE_ADC_ONE_ANA_TRIM_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_SYS_CTRL AFE_ADC_ONE_SYS_CTRL
 * @brief    System Calibration Selection
 * @{
 */
#define MXC_F_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_POS     0 /**< SYS_CTRL_ANA_SRC_SEL Position */
#define MXC_F_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL         ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_POS)) /**< SYS_CTRL_ANA_SRC_SEL Mask */
#define MXC_V_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_ADC0_BANK ((uint8_t)0x0UL) /**< SYS_CTRL_ANA_SRC_SEL_ADC0_BANK Value */
#define MXC_S_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_ADC0_BANK (MXC_V_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_ADC0_BANK << MXC_F_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_POS) /**< SYS_CTRL_ANA_SRC_SEL_ADC0_BANK Setting */
#define MXC_V_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_ADC1_BANK ((uint8_t)0x1UL) /**< SYS_CTRL_ANA_SRC_SEL_ADC1_BANK Value */
#define MXC_S_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_ADC1_BANK (MXC_V_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_ADC1_BANK << MXC_F_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_POS) /**< SYS_CTRL_ANA_SRC_SEL_ADC1_BANK Setting */
#define MXC_V_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_DAC12_BANK ((uint8_t)0x2UL) /**< SYS_CTRL_ANA_SRC_SEL_DAC12_BANK Value */
#define MXC_S_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_DAC12_BANK (MXC_V_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_DAC12_BANK << MXC_F_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_POS) /**< SYS_CTRL_ANA_SRC_SEL_DAC12_BANK Setting */
#define MXC_V_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_HART_BANK ((uint8_t)0x3UL) /**< SYS_CTRL_ANA_SRC_SEL_HART_BANK Value */
#define MXC_S_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_HART_BANK (MXC_V_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_HART_BANK << MXC_F_AFE_ADC_ONE_SYS_CTRL_ANA_SRC_SEL_POS) /**< SYS_CTRL_ANA_SRC_SEL_HART_BANK Setting */

#define MXC_F_AFE_ADC_ONE_SYS_CTRL_CRC5_POS            2 /**< SYS_CTRL_CRC5 Position */
#define MXC_F_AFE_ADC_ONE_SYS_CTRL_CRC5                ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_SYS_CTRL_CRC5_POS)) /**< SYS_CTRL_CRC5 Mask */

#define MXC_F_AFE_ADC_ONE_SYS_CTRL_ST_DIS_POS          3 /**< SYS_CTRL_ST_DIS Position */
#define MXC_F_AFE_ADC_ONE_SYS_CTRL_ST_DIS              ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_SYS_CTRL_ST_DIS_POS)) /**< SYS_CTRL_ST_DIS Mask */

#define MXC_F_AFE_ADC_ONE_SYS_CTRL_HART_EN_POS         4 /**< SYS_CTRL_HART_EN Position */
#define MXC_F_AFE_ADC_ONE_SYS_CTRL_HART_EN             ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_SYS_CTRL_HART_EN_POS)) /**< SYS_CTRL_HART_EN Mask */

#define MXC_F_AFE_ADC_ONE_SYS_CTRL_SPI_ABORT_DIS_POS   5 /**< SYS_CTRL_SPI_ABORT_DIS Position */
#define MXC_F_AFE_ADC_ONE_SYS_CTRL_SPI_ABORT_DIS       ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_SYS_CTRL_SPI_ABORT_DIS_POS)) /**< SYS_CTRL_SPI_ABORT_DIS Mask */

#define MXC_F_AFE_ADC_ONE_SYS_CTRL_POR_FLAG_POS        6 /**< SYS_CTRL_POR_FLAG Position */
#define MXC_F_AFE_ADC_ONE_SYS_CTRL_POR_FLAG            ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_SYS_CTRL_POR_FLAG_POS)) /**< SYS_CTRL_POR_FLAG Mask */

#define MXC_F_AFE_ADC_ONE_SYS_CTRL_CRC_INV_POS         7 /**< SYS_CTRL_CRC_INV Position */
#define MXC_F_AFE_ADC_ONE_SYS_CTRL_CRC_INV             ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_SYS_CTRL_CRC_INV_POS)) /**< SYS_CTRL_CRC_INV Mask */

/**@} end of group AFE_ADC_ONE_SYS_CTRL_Register */

/**
 * @ingroup  afe_adc_one_registers
 * @defgroup AFE_ADC_ONE_TS_CTRL AFE_ADC_ONE_TS_CTRL
 * @brief    Temperature Sensor Control
 * @{
 */
#define MXC_F_AFE_ADC_ONE_TS_CTRL_TS_EN_POS            0 /**< TS_CTRL_TS_EN Position */
#define MXC_F_AFE_ADC_ONE_TS_CTRL_TS_EN                ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_TS_CTRL_TS_EN_POS)) /**< TS_CTRL_TS_EN Mask */

#define MXC_F_AFE_ADC_ONE_TS_CTRL_TS_CONV_EN_POS       1 /**< TS_CTRL_TS_CONV_EN Position */
#define MXC_F_AFE_ADC_ONE_TS_CTRL_TS_CONV_EN           ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_TS_CTRL_TS_CONV_EN_POS)) /**< TS_CTRL_TS_CONV_EN Mask */

#define MXC_F_AFE_ADC_ONE_TS_CTRL_TS_INTG_RDY_POS      2 /**< TS_CTRL_TS_INTG_RDY Position */
#define MXC_F_AFE_ADC_ONE_TS_CTRL_TS_INTG_RDY          ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ONE_TS_CTRL_TS_INTG_RDY_POS)) /**< TS_CTRL_TS_INTG_RDY Mask */

/**@} end of group AFE_ADC_ONE_TS_CTRL_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32680_INCLUDE_AFE_ADC_ONE_REGS_H_
